const cityname = ["赤", "市", "平", "阿", "鶴", "居", "旭", "川", "芦", "寄", "陸", "厚", "浜", "中", "網", "大", "津", "美", "幌", "田", "喜", "茂", "京", "極", "倶", "知", "安", "湖", "豊", "浦", "真", "留", "寿", "都", "石", "新", "篠", "当", "磯", "谷", "越", "岩", "内", "共", "和", "見", "沢", "有", "珠", "壮", "河", "竜", "秩", "父", "沼", "北", "加", "江", "奥", "尻", "小", "樽", "帯", "広", "西", "札", "芽", "室", "東", "上", "士", "鹿", "追", "樺", "戸", "臼", "十", "月", "形", "木", "古", "淵", "清", "水", "下", "鷹", "栖", "麻", "神", "楽", "比", "布", "亀", "七", "茅", "釧", "路", "久", "遠", "白", "央", "南", "沙", "流", "日", "高", "取", "牧", "丹", "里", "瀬", "宗", "富",  "野", "奈", "井", "滝", "伊", "達", "千", "歳", "天", "塩", "延", "勝", "常", "呂", "佐", "間", "苫", "前", "初", "山", "羽", "池", "深", "本", "幕", "名", "乙", "付", "檜", "差", "国", "尾", "二", "八", "宇", "泊", "斗", "泉", "毛", "福", "三", "笠", "目", "梨", "武", "興", "長", "万", "夕", "張", "由", "仁", "利", "礼", "文", "稚", "青", "辺", "地", "横", "六", "ヶ", "所", "板", "柳", "五", "原", "郷", "風", "通", "蓬", "弘", "藤", "崎", "一", "関", "葛", "雫", "渡", "釜", "閉", "九", "米", "気", "仙", "畑", "代", "波", "矢", "巾", "磐", "幡", "花", "宮", "盛", "岡", "賀", "丸", "角", "刈", "王", "宿", "色", "竈", "柴", "台", "葉", "太", "城", "若", "林", "多", "涌", "亘", "元", "秋", "後", "成", "潟", "坂", "能", "峰", "湯", "荘", "遊", "酒", "庄", "陽", "朝", "畠", "最", "鮭", "会", "玉", "浅", "栄", "方", "須", "相", "舘", "俣", "桑", "吹", "鮫", "倉", "双", "熊", "浪", "只", "岐", "来", "嶋", "茨", "霞", "境", "総", "萩", "筑", "土", "那", "珂", "行", "洗", "立", "鉾", "守", "結", "龍", "壬", "生", "栃", "烏", "光", "芳", "貝", "益", "吾", "草", "嬬", "恋", "之", "条", "勢", "明", "甘", "群", "桐", "片", "品", "場", "橋", "入", "口", "杉", "児", "槻", "狭", "滑", "埼", "我", "孫", "房", "隅", "御", "印", "旛", "々", "柏", "香", "鎌", "鴨", "君", "銚", "四", "梅", "分", "寺", "狛", "墨", "世", "摩", "調", "出", "瑞", "穂", "練", "甲", "綾", "模", "逗", "秦", "塚", "保", "糸", "魚", "蒲", "籠", "燕", "彦", "灘", "鳳", "穴", "輪", "鯖", "敦", "永", "斐", "菅", "巨", "韮", "早", "桂", "辰", "箕", "信", "濃", "曽", "駒", "諸", "智", "條", "丘", "泰", "阜", "曲", "垣", "各", "務", "可", "百", "飛", "騨", "破", "垂", "熱", "掛", "菊", "静", "葵", "駿", "周", "袋", "犬", "扶", "碧", "鷲", "牟", "紀", "岬", "鈴", "鳥", "阪", "舞", "向", "此", "正", "淀", "交", "門", "堺", "摂", "曳", "枚", "尼", "淡", "播", "庫", "用", "橿", "陵", "備", "窪", "竹", "呉", "徳", "鞍", "苅", "杵", "壱", "諫", "蘇", "錦", "奄", "薩",];
const sample = ["川", "山", "岡", "田","山","ヶ丘","町","市","台","島","湖","野","崎","津","本","谷"];
var first = 0;

function del(){  //地名表示要素の削除関数
    let child = document.getElementById("Child");
    if(first < 1){
        first++;
    }else{
        child.remove();
    }}

function ramdom(){
    City = (cityname [Math.floor (Math.random() * cityname.length)]);
    City3 = (cityname [Math.floor (Math.random() * cityname.length)]);
}

function Placename(){
    del();
    let kotei = document.getElementById("front");
    let Text = document.getElementById("Text").value;
    let table = document.createElement("table");
    table.setAttribute("id","Child")
    document.getElementById("Div").appendChild(table);
    
for(i = 0; i<5; i++){
    let tr = table.insertRow(-1);
    var City2 = sample[i];
    if(Text){   //文字指定
        if(kotei.checked){
            ramdom()//一行目文字指定前
            var td = tr.insertCell(-1);
            td.innerHTML = Text+City3;
        }else{
            ramdom()//一行目文字指定後ろ
            td = tr.insertCell(-1);
            td.innerHTML = City+Text;
        }
    }else{
        ramdom()//一行目文字指定なし
        td = tr.insertCell(-1);
        td.innerHTML = City+City3;
    }
    {
        ramdom()//二行目
        td = tr.insertCell(-1);
        td.innerHTML = City+City2;
    }{
        ramdom()//三行目
        td = tr.insertCell(-1);
        City2 = sample[i+10]
        td.innerHTML = City+City2;
    }{
        ramdom()//四行目
        td = tr.insertCell(-1);
        City2 = sample[i+5];
        td.innerHTML = City+City2;
    }{
        ramdom()//五行目
        td = tr.insertCell(-1);
        td.innerHTML = City+City3+City2;
    }
}
}
